
## Plan Result




<pre><code>Plan: 0 to add, 6 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
  * module.application_insights.azurerm_application_insights.this
  * module.case-disposer-action-group.azurerm_resource_group_template_deployment.action-group
  * module.lau-vault.azurerm_key_vault.kv
  * module.lau-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.lau-vault.azurerm_user_assigned_identity.managed_identity[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.caseDisposerAlertEmail will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "caseDisposerAlertEmail" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
      + name                    = "caseDisposerAlertEmail"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat"
        name     = "lau-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/lau-shared-infrastructure.git" -> null
            "application"         = "log-and-audit"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/lau-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "staging"
            "managedBy"           = "LAU"
        }
        # (1 unchanged attribute hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  # (moved from azurerm_application_insights.appinsights)
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_in_gb                  = 100 -> 50
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.Insights/components/lau-aat"
        name                                  = "lau-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/lau-shared-infrastructure.git" -> null
            "application"         = "log-and-audit"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/lau-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "staging"
            "managedBy"           = "LAU"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
        # (14 unchanged attributes hidden)
    }

  # module.case-disposer-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccd-shared-aat/providers/Microsoft.Resources/deployments/dispr-alert"
        name                = "dispr-alert"
      ~ parameters_content  = (sensitive value)
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.lau-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat"
        name                            = "lau-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/lau-shared-infrastructure.git" -> null
            "application"         = "log-and-audit"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/lau-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "staging"
            "managedBy"           = "LAU"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.lau-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)
    }

  # module.lau-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/lau-aat-mi"
        name                = "lau-aat-mi"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/lau-shared-infrastructure.git" -> null
            "application"         = "log-and-audit"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/lau-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "staging"
            "managedBy"           = "LAU"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":33,"Program":"tfcmt","SHA1":"","Vars":{}} -->